tiendungtran-msl/nuttxspace/.history/nuttx/boards/arm/stm32/stm32f411-minimum/src/stm32_appinit_20251021210034.c
/****************************************************************************
 * boards/arm/stm32/stm32f411-minimum/src/stm32_appinit.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdio.h>
#include <syslog.h>
#include <errno.h>

#include <nuttx/arch.h>
#include <nuttx/board.h>

#include <stm32.h>
#include <stm32_uart.h>

#include <arch/board/board.h>

#include "stm32f411-minimum.h"

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: board_app_initialize
 *
 * Description:
 *   Perform application specific initialization.  This function is never
 *   called directly from application code, but only indirectly via the
 *   (non-standard) boardctl() interface using the command BOARDIOC_INIT.
 *
 * Input Parameters:
 *   arg - The boardctl() argument is passed to the board_app_initialize()
 *         implementation without modification.  The argument has no
 *         meaning to NuttX; the meaning of the argument is a contract
 *         between the board-specific initialization logic and the
 *         matching application logic.  The value could be such things as a
 *         mode enumeration value, a set of DIP switch switch settings, a
 *         pointer to configuration data read from a file or serial FLASH,
 *         or whatever you would like to do with it.  Every implementation
 *         should accept zero/NULL as a default configuration.
 *
 * Returned Value:
 *   Zero (OK) is returned on success; a negated errno value is returned on
 *   any failure to indicate the nature of the failure.
 *
 ****************************************************************************/
/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Application Configuration */

#ifndef CONFIG_EXAMPLES_STM32_BLINK_PRIORITY
#  define CONFIG_EXAMPLES_STM32_BLINK_PRIORITY 100
#endif

#ifndef CONFIG_EXAMPLES_STM32_BLINK_STACKSIZE
#  define CONFIG_EXAMPLES_STM32_BLINK_STACKSIZE 2048
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/* Entry point for the blink application */

extern int stm32_blink_main(int argc, char *argv[]);

/****************************************************************************
 * Name: board_app_initialize
 *
 * Description:
 *   Perform application specific initialization.
 *
 ****************************************************************************/

int board_app_initialize(uintptr_t arg)
{
#ifndef CONFIG_BOARD_LATE_INITIALIZE
  /* Perform board-specific initialization */

  return stm32_bringup();

  #ifdef CONFIG_EXAMPLES_STM32_BLINK
  int ret;
  
  ret = task_create("stm32_blink",
                    STM32_BLINK_PRIORITY,
                    STM32_BLINK_STACKSIZE,
                    main,
                    NULL);

  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: Failed to start stm32_blink: %d\n", ret);
    }
  else
    {
      syslog(LOG_INFO, "STM32 Blink application started (PID: %d)\n", ret);
    }
#endif

#else
  return OK;
#endif
}
